// Auto-generated database export from SkyrexTg components.db
const botDb = {
    components: [
        {
            "id": 1,
            "type": "gpu",
            "componentname": "GTX 1050 Ti",
            "mark": 3,
            "price": 4000,
            "minprice": null,
            "comment": "1)Актуальность - Устарела.\n 2)Состояние - Уставшие. \n 3)Производительность - Лагает даже на низких в Full HD \n 4) Проблемы - не справляется с современными задачами \n 5)Вердикт - Крайне устаревшая видеокарта, нет смысла покупать, даже в простых играх будут просадки из-за малого обема видео памяти",
            "analogue": ""
        },
        {
            "id": 2,
            "type": "gpu",
            "componentname": "RX 570",
            "mark": 3,
            "price": 4000,
            "minprice": null,
            "comment": "1)Актуальность - Устарела.\n 2)Состояние - Уставшие. \n 3)Производительность - Лагает даже на низких в Full HD \n 4) Проблемы - не справляется с современными задачами \n 5)Вердикт - Крайне устаревшая видеокарта, нет смысла покупать, даже в простых играх будут просадки из-за малого обема видео памяти",
            "analogue": ""
        },
        {
            "id": 3,
            "type": "gpu",
            "componentname": "GTX 1060 3Gb",
            "mark": 3,
            "price": 4500,
            "minprice": null,
            "comment": "1)Актуальность - Устарела \n 2)Состояние - Уставшие  \n 3)Производительность - Лагает даже на низких в Ful Hd \n 4) Проблемы - Крайне мало видеопамяти \n 5)Вердикт - Лучше найти 1060 с 6 Gb видеопамяти. На 3 Gb брать не рекомендую",
            "analogue": ""
        },
        {
            "id": 4,
            "type": "gpu",
            "componentname": "RX 580 4Gb",
            "mark": 3,
            "price": 4300,
            "minprice": null,
            "comment": "1)Актуальность - Устарела \n 2)Состояние - Уставшие  \n 3)Производительность - Лагает даже на низких в Ful Hd \n 4) Проблемы - Крайне мало видеопамяти \n 5)Вердикт - Лучше найти 580 с 8 Gb видеопамяти. На 4 Gb брать не рекомендую",
            "analogue": ""
        },
        {
            "id": 5,
            "type": "gpu",
            "componentname": "RX 580 8Gb",
            "mark": 4,
            "price": 5500,
            "minprice": null,
            "comment": "1)Актуальность - Устаревает \n 2)Состояние - Часто уставшие \n 3)Производительность - минимум для игр в Full Hd \n 4) Проблемы - тяжело найти живой экземпляр \n 5)Вердикт - Базовый минимум для игр. На низких в Full HD онлайн игры пойдут нормально. Главнное найти хороший не майненый экземпляр",
            "analogue": "GTX 1060 6 Gb \n Да видеопамяти меньше, но при этом чип мощнее, и живых экземпляров куда больше."
        },
        {
            "id": 6,
            "type": "gpu",
            "componentname": "GTX 1060 6Gb",
            "mark": 6,
            "price": 6000,
            "minprice": 5000,
            "comment": "1)Актуальность - Устаревает \n 2)Состояние - Часто живые \n 3)Производительность - минимум для игр в Full Hd  \n 4) Проблемы - года берут свое, нужно внимательно проверять работу кулеров и после покупки менять все термопрокладки и термпоасту  \n 5)Вердикт - Хорошая минимальная видеокарта за свой бюджет, цена слегка завышенна, но если проявить скил и сторговаться до 5500 то можно купить действительно достойный вариант",
            "analogue": "RX 580 8 Gb \n Неплохая альтернатива с большим обемом видеопамяти, но тяжело найти живой вариант. А если цена сильно ниже чем у 1060 и при этом состояние хорошее то можно смело брать!"
        },
        {
            "id": 7,
            "type": "gpu",
            "componentname": "GTX 1070 8Gb",
            "mark": 4,
            "price": 8500,
            "minprice": null,
            "comment": "1)Актуальность - Устарела \n 2)Состояние - Часто уставшие \n 3)Производительность - средне высокие в FULL HD  \n 4) Проблемы - слишком завышенна цена \n 5)Вердикт - Можно взять только если ну супер вкусная цена, а так отдавать за эту видеокарту 9 тысяч рублей, бессмысленно.",
            "analogue": ""
        },
        {
            "id": 8,
            "type": "gpu",
            "componentname": "GTX 1650",
            "mark": 4,
            "price": 6500,
            "minprice": null,
            "comment": "1)Актуальность - Актуальная  \n 2)Состояние -  в основном в хорошем состоянии \n 3)Производительность - низкие настройки в Full Hd  \n 4) Проблемы - малый обем видеопамяти  \n 5)Вердикт - Свежая видеокарта за свой прайс, но из-за малого обема видеопамяти выдет крайне мало фпс, советую брать только если хотите взять что-то свежее",
            "analogue": "GTX 1060 6 Gb \n Больше видеопамяти, показывает более стабильные фпс в играх."
        },
        {
            "id": 9,
            "type": "gpu",
            "componentname": "GTX 1660 super",
            "mark": 6,
            "price": 10000,
            "minprice": 9000,
            "comment": "1)Актуальность - Актуально  \n 2)Состояние - В основном в хорошем состоянии  \n 3)Производительность - Средние в Full HD  \n 4) Проблемы - Слишком завышенна цена \n 5)Вердикт - Хорошая видеокарта, базовый минимум для full hd. Вопрос только в цене, отдавать 10 тысяч рублей за нее грустно, но если дешевле не нашли, лучше переплатите но возьмите в живом состоянии. Прослужит еще долго, на низких в большинство игр можно будет играть.",
            "analogue": "GTX 1080 \n Больше видеопамяти, больше фпс в AAA играх. Из минусов устаревшаяя видеокарта, тяжело найти живую"
        },
        {
            "id": 10,
            "type": "gpu",
            "componentname": "GTX 1080",
            "mark": 5,
            "price": 9500,
            "minprice": null,
            "comment": "1)Актуальность - Устаревшая  \n 2)Состояние - Уставшее \n 3)Производительность - Средне высокие в FULL HD \n 4) Проблемы - старая видеокарта, тяжело найти живую  \n 5)Вердикт можно взять если действительно попался хороший вариант,с приятной ценой",
            "analogue": ""
        },
        {
            "id": 11,
            "type": "gpu",
            "componentname": "GTX 2060",
            "mark": 4,
            "price": 10100,
            "minprice": null,
            "comment": "1)Актуальность - Устаревшая  \n 2)Состояние - Часто уставшее \n 3)Производительность - Средние в Full HD \n 4) Проблемы - оверпрайс и малый обем видеопамяти  \n 5)Вердикт - Рекомендую брать если найдете дешевле 1660 super и в супер хорошем состоянии. Реальная цена этой видеоркаты тысяч 9, но рынок к сожалению считает по другому",
            "analogue": ""
        },
        {
            "id": 12,
            "type": "gpu",
            "componentname": "RX 5700xt",
            "mark": 3,
            "price": 13500,
            "minprice": null,
            "comment": "1)Актуальность - Устарела \n 2)Состояние - Уставшие \n 3)Производительность - Вредне высокие настройки в Full HD  \n 4) Проблемы - В основном после майнинга  \n 5)Вердикт - Неплохая видеокарта достаточно мощьная, НО тяжело найти живую, в основном все либо после майнинга либо пересобраные рефабы с Китая.",
            "analogue": ""
        },
        {
            "id": 13,
            "type": "gpu",
            "componentname": "RX 6600",
            "mark": 10,
            "price": 15000,
            "minprice": 12500,
            "comment": "1)Актуальность - Актуальна \n 2)Состояние - Почти всегда в хорошем состоянии \n 3)Производительность - Хорошо подойдет для Full Hd  \n 4) Проблемы - Практически нет \n 5)Вердикт - Лучшая видеокарта за свой прайс! Я как и многие не особо люблю AMD видеокарты, но 6600 запала мне в сердце! Почему она? \n За 15.000 вы найдете реально живой вариант, которым скорее всего пользовался один человек. Их практически не бывало в майнинге! Видеокарта сама по себе свежаяя и многие продают их еще на гарантии! Так-же очень много вариантов на Авито! Берите и пользуйтесь!",
            "analogue": "RTX 2060 Super \n Аналог от nvidia, который проигрывает во всем! Во первых очень тяжело найти  живую. Во вторых очень часто бывали в майнинге, многие продают оптом. В третьих цена зачастую выше чем у Rx 6600. \n Советую взять только если берете у знакомых или друзей в очень хорошем состоянии тысяч за 14, она будет чуть мощнее чем 6600 и если состояние хорошее то можно взять!"
        },
        {
            "id": 14,
            "type": "gpu",
            "componentname": "RTX 2060 Super",
            "mark": 6,
            "price": 15000,
            "minprice": 15500,
            "comment": "1)Актуальность - Актуальна \n 2)Состояние - Часто уставшее \n 3)Производительность - Хорошо подойдет для Full HD \n 4) Проблемы - В основном после майнинга, уставшие винты, и состояния карточек  \n 5)Вердикт - Если нашли живой вариант ниже 15.000 или взяли у знакомых или друзей то хороший вариант! Но на Авито крайне тяжело найти в хорошем состоянии, в основном все убитые",
            "analogue": "RX 6600 \n Реально найти живую! Реально купить за 14.000! Реально крутой аналог! То что многие не любят AMD могу почнять, но после этой видеокарты, ваше мнение может измениться!"
        },
        {
            "id": 15,
            "type": "gpu",
            "componentname": "RTX 3060 12 Gb",
            "mark": 8,
            "price": 19500,
            "minprice": 17500,
            "comment": "1)Актуальность - Актуальна \n 2)Состояние - Почти всегда в хорошем состоянии \n 3)Производительность - Уверенные высокие настройки в Full HD  \n 4) Проблемы - Проверять состояние кулеров, нет ли люфта. И проверять не была ли в майнинге  \n 5)Вердикт - Крутая карточка, которая может крайне хорошо подойти для Full HD, за счет 12 гб VRM хватит на много лет вперед. Единственная проблема - это цена! Нужно хорошо торговаться и договариваться, что-бы купить ее хотя бы за 18!",
            "analogue": "RX 6600xt \n Неплохая альтернатива, которую можно рассмотреть только если она выходит сильно дешевле чем, 3060!"
        },
        {
            "id": 16,
            "type": "gpu",
            "componentname": "RX 6600xt",
            "mark": 7,
            "price": 18500,
            "minprice": null,
            "comment": "1)Актуальность - Актуальна \n 2)Состояние - в основном хорошее \n 3)Производительность - Хорошо подойдет для Full HD  \n 4) Проблемы - Могла быть в майнинге  \n 5)Вердикт - неплохая карточка, но когда есть аналог в виде 3060 смысла большого брать ее нет. Только если нашли дешевле и при этом в хорошем состоянии!",
            "analogue": "RTX 3060 \n Если найти по вкусной цене получите одну из лучших видеокарт до 20.000 рублей. За счет 12 гб VRM дольше останется актуальной!"
        },
        {
            "id": 17,
            "type": "gpu",
            "componentname": "RTX 3060Ti",
            "mark": 5,
            "price": 21000,
            "minprice": null,
            "comment": "1)Актуальность - Актуальна \n 2)Состояние - Свежее \n 3)Производительность - Ультра в Full HD  \n 4) Проблемы - Отвал чипов (если не Samsung). После майнинга \n 5)Вердикт - Тяжело найти в хорошем состоянии и по хорошей цене, на такие экземпляры цена завышенна. Если чип не Samsung шанс того что чип отвалится слишком высок, не раз сталкивался с этим при собрках. Новичкам брать не рекомендую, при поиске живого экземпляра есть шанс остаться заикой.",
            "analogue": "RTX 3070 \n Цена чуть выше а именно 22.000, но зато вы получаете карту которая сильно мощьнее, правда тут тоже не все однозначно, в основном их продают после майнинга, и это как раз таки тот случай когда можно взять карту с майнинга. Перед продажей их хорошо обслуживают, и карта сделана хорошо, с ней даже после майнинга нечего не будет. Конечно вы всегда можете поискать живой вариант, но я вам говорю за основной рынок"
        },
        {
            "id": 18,
            "type": "gpu",
            "componentname": "RTX 3070",
            "mark": 8,
            "price": 22000,
            "minprice": 19600,
            "comment": "1)Актуальность - Актуально \n 2)Состояние - Свежее \n 3)Производительность - Лучшая видеокарта для Full Hd до 25.000 и даже подойдет для начального QHD \n 4) Проблемы - В основном после майнинга  \n 5)Вердикт - Это пример реальной мощи, которая сравнима с новой 5060, брать в случае если найдете живой экземпляр, или же если готовы к тому, что она была в майнинге но перед продажей хорошо обсулженна, таких вариантов на самом деле много и цена на них приятно ниже. Тут не стоит боятся, что она была в майнинге, 3070 вообще все равно на него, карта реально крутая за свою цену!",
            "analogue": "Rtx 3060 Ti \n Аналог подешевле, брать только в случае если нашли реально живой вариант, и при этом цена сильно ниже!"
        },
        {
            "id": 19,
            "type": "gpu",
            "componentname": "RTX 4060",
            "mark": 6,
            "price": 25000,
            "minprice": null,
            "comment": "1)Актуальность - Актуальна \n 2)Состояние - Свежайшее \n 3)Производительность - Крайне хорошее для Full HD  \n 4) Проблемы - Высокая цена  \n 5)Вердикт - Цена не обективно завшенна для б\\у видеокарты! Это просто бред! Поэтому не рекомендую брать! Только если цена 23.000 и то! Есть нюанс!",
            "analogue": "RTX 5050 \n Вы сейчас увидели ее и такие че?! А что если я вам скажу что такую видеокарту можно у перекупа смело купить за 23.000? При этом она будет полностью новую на гарантии! Да она слабее процентов на 10, но Карл! Она новая! Бегом смотреть на Авито!"
        },
        {
            "id": 20,
            "type": "gpu",
            "componentname": "RTX 5050",
            "mark": 10,
            "price": 24000,
            "minprice": 23000,
            "comment": "1)Актуальность - Максимально Актуальна \n 2)Состояние - Новая \n 3)Производительность - Уверенный Full HD  \n 4) Проблемы - нет  \n 5)Вердикт - Новая видеокарта за 23.000?! На Авито куча перекупов котоырй перепрадают эту имбу, и кстаити большинство еще гарантию на нее дает! Так что да это лучшая видеокарта до 25.000! Я уже молчу про длсс и про то, что до вас ее не кто не трогал!",
            "analogue": "RTX 3070 \n По техническим характеристикам мощьнее, по цене дешевле, но найти живую крайне тяжело, брать только если хотите мощьную карту за приятную цену, и то, что большинство после майнинга вам не страшно!"
        },
        {
            "id": 21,
            "type": "gpu",
            "componentname": "RTX 5060",
            "mark": 8,
            "price": 30000,
            "minprice": 28000,
            "comment": "1)Актуальность - Максимально акутально \n 2)Состояние - Новая \n 3)Производительность - Реально лучшая для Full HD  \n 4) Проблемы - нет  \n 5)Вердикт - Новая видеокарта за 29.000. На Авито куча перекупов которые продают их новыми с гарантией! Смело берите не платите маркетплейсам или днс!",
            "analogue": ""
        },
        {
            "id": 22,
            "type": "cpu",
            "componentname": "Ryzen 5 2600",
            "mark": 7,
            "price": 3000,
            "minprice": 1900,
            "comment": "1)Актуальность - Староват \n 2)Состояние - Хорошее \n 3)Производительность - Расроет видеокарту до RX 6600\\RTX 2060 Super  \n 4) Проблемы - Староват  \n 5)Вердикт - Неплохой проц за 2.000. Выдает вполне играбельные фпс, базовый минимум в 2026!",
            "analogue": ""
        },
        {
            "id": 23,
            "type": "cpu",
            "componentname": "Intel i5 9400f",
            "mark": 4,
            "price": 3500,
            "minprice": null,
            "comment": "1)Актуальность - Староват \n 2)Состояние - Хорошее  \n 3)Производительность - Раскроет видеокарту до 1660 Super \n 4) Проблемы - Нет \n 5)Вердикт - Можно взять если хорошая цена комплекта или отдельно урваили за копейки",
            "analogue": "Ryzen 5 2600 \n Намного интереснее, более стабилные фпс, и больше подойдет в этом бюджете"
        },
        {
            "id": 24,
            "type": "cpu",
            "componentname": "Intel i3 12100f",
            "mark": 6,
            "price": 4500,
            "minprice": null,
            "comment": "1)Актуальность - Актуален \n 2)Состояние - Хорошее \n 3)Производительность - Раскроет видеокарту до RTX 3060\\ RX6600 XT  \n 4) Проблемы - мало ядер и потоков \n 5)Вердикт - Хороший процессор, но сейчас цена на него сильно выросла, рекомендую рассмотреть аналог.",
            "analogue": "Ryzen 5500 \n В 2026 намного интереснее из-за большего кол-ва потоков, в AAA выдает столько же фпс, но вот в онлайн играх намного лучше чем 12100f"
        },
        {
            "id": 25,
            "type": "cpu",
            "componentname": "Ryzen 5 3600",
            "mark": 4,
            "price": 4900,
            "minprice": null,
            "comment": "1)Актуальность - Актуален \n 2)Состояние - Хорошее \n 3)Производительность - Раскроет видеокарту до RTX 3060\\ RX6600 XT  \n 4) Проблемы - цена \n 5)Вердикт - Если вы взяли его комплектом с материнкой за приятную цену то хороший проц. Но отдавать за него 5.000 это крайне не разумно, ведь добавив буквально тысячу вы получаете аналог который круче",
            "analogue": "Ryzen 5500 \n За 6.000 вы получаете крутой проц, который хорошо тянет современные игры, и ближайшие пару лет еще будет тянуть!"
        },
        {
            "id": 26,
            "type": "cpu",
            "componentname": "Ryzen 5 5500",
            "mark": 9,
            "price": 6000,
            "minprice": 5000,
            "comment": "1)Актуальность - Актуален \n 2)Состояние - Хорошее \n 3)Производительность - Раскроет видеокарту до RTX 3070 \n 4) Проблемы - Нет  \n 5)Вердикт - Топовый камень в соотношении цены - качества. Идеально подойдет и для тех кто играет только в онлайн игры, и для тех кто проходит крупные AAA.",
            "analogue": "Intel i3 12100f \n Неплохой аналог, но ценик на него поднялся и смысла в его покупке практически нет."
        },
        {
            "id": 27,
            "type": "cpu",
            "componentname": "Ryzen 5 5600",
            "mark": 7,
            "price": 9000,
            "minprice": null,
            "comment": "1)Актуальность - Актуален \n 2)Состояние - Хорошее  \n 3)Производительность - Раскроет видеокарту до RTX 5070  \n 4) Проблемы - Нет  \n 5)Вердикт - Хороший процессор, главная проблема найти по адекватной цене, так что ищите паралельно с аналогом и что выйдет выгоднее то и покупайте! \n Если увидели версию Ryzen 5 5600x можете так-же смело покупать по хорошей цене! А вот Ryzen 5 5600G не стоит - она чуть слабее.",
            "analogue": "Intel i5 12400f \n Чуть мощьнее 5600 главное найти по адекватной цене, а так оба процессора достойные"
        },
        {
            "id": 28,
            "type": "cpu",
            "componentname": "Intel i5 12400f",
            "mark": 8,
            "price": 8500,
            "minprice": 7000,
            "comment": "1)Актуальность - Актуален \n 2)Состояние - Хорошее \n 3)Производительность - Раскроет видеокарту до RTX 5070  \n 4) Проблемы - Нет  \n 5)Вердикт - Хороший процессор, главная проблема найти по адекватной цене, так что ищите паралельно с аналогом и что выйдет выгоднее то и покупайте!",
            "analogue": "Ryzen 5 5600 \n Крутой аналог главное найти по хорошей цене, чуть слабее но не критично!"
        }
    ],
    bestpc: [
        {
            "id": 1,
            "pcname": "Базовый минимум для игр",
            "pcprice": 38000,
            "components": [
                {
                    "name": "Видеокарта GTX 1660 Super",
                    "link": "https://www.avito.ru/all/tovary_dlya_kompyutera/komplektuyuschie/videokarty-ASgBAgICAkTGB~pm7gmmZw?cd=1&q=1660+super",
                    "price": 10000,
                    "comment": "Наш реальный базовый минимум для Full HD. Будет неплохо показывать себя в онлайн проектах еще долго, но в AAA играх ей будет крайне тяжело, за счет маленького обема видеопамяти. Пару лет на низких поиграть сможете."
                },
                {
                    "name": "Процессор Intel i3 12100f",
                    "link": "https://www.avito.ru/all/tovary_dlya_kompyutera/komplektuyuschie/protsessory-ASgBAgICAkTGB~pm7gniZw?cd=1&q=i3+12100f",
                    "price": 4500,
                    "comment": "Лучший бюджетный проц, конурирует по мощьности с Ryzen 5500, при этом дешевле зачастую на 2 тысячи рублей. Можно как аналог расмотреть r5 3600, но его еще нужно найти за 4 тысчи рублей. Если сомневаетесь в выборе, тесты в помощь!"
                },
                {
                    "name": "Материнская плата H610M",
                    "link": "https://www.avito.ru/all/tovary_dlya_kompyutera/komplektuyuschie/materinskie_platy-ASgBAgICAkTGB~pm7gnOZw?cd=1&q=h610",
                    "price": 4000,
                    "comment": "База, для нашего процессора больше не понадобится, ищите варианты плюс минус именитых брендов, часто эти матерники отдают комплектом с вышеупомянутым процессором"
                },
                {
                    "name": "SSD NVME 256Gb",
                    "link": "https://www.avito.ru/all/tovary_dlya_kompyutera/komplektuyuschie/zhestkie_diski-ASgBAgICAkTGB~pm7gmwZw?cd=1&q=ssd+m2+256",
                    "price": 2500,
                    "comment": "Берем для системы и программ, для игр рекомендую взять HDD на 500 гигабайт. При покупке обязательно проверяем в Crystal Disk! Что бы состояние было приближенное к идеалу"
                },
                {
                    "name": "Оперативная память",
                    "link": "https://www.avito.ru/all/tovary_dlya_kompyutera/komplektuyuschie-ASgBAgICAUTGB~pm?cd=1&q=оперативная+память+ddr4+16gb",
                    "price": 7000,
                    "comment": "Ищем 16 гигабайт с частотой 3200, и первым таймингом cl16 или cl18. Проверяйте оперативку что бы работала в XMP профиле, и самое главно что бы плашки были одинаковые! Для работы двух канала"
                },
                {
                    "name": "Блок питания Powercase PW500, 500W, 80+ Standart (PS-500W-DC)",
                    "link": "https://www.onlinetrade.ru/catalogue/bloki_pitaniya_dlya_kompyutera-c339/powercase/blok_pitaniya_powercase_pw500_500w_80_standart_ps_500w_dc-4416114.html",
                    "price": 3000,
                    "comment": "Японский конденсатор на входе, китай на выходе. Есть защиты от перегрева и от замыкания. Гарантия 36 мес."
                },
                {
                    "name": "Корпус XASTRA A305M 3ARGB, черный",
                    "link": "https://www.onlinetrade.ru/catalogue/kompyuternye_korpusa-c1323/xastra/korpus_xastra_a305m_3argb_chernyy_a305m_2fc14a_1fc12a_d-4714577.html?utm_referrer=https%3a%2f%2fwww.google.com%2f",
                    "price": 3500,
                    "comment": "Красивый, стильный корпус. С 3 ARGB вентиляторами в комплектке. Так же открывается боковая крышка. За свою цену топ!"
                },
                {
                    "name": "Кулер для процессора JONSBO CR-1000 EVO ARGB (Black)",
                    "link": "https://www.onlinetrade.ru/catalogue/kulery_dlya_protsessorov-c1492/jonsbo/kuler_dlya_protsessora_jonsbo_cr_1000_evo_argb_black-3784863.html",
                    "price": 1500,
                    "comment": "Базовый кулер с T.D.P 180w для нашего процессора хватит с головой. Также достаточно приятный внешний вид"
                },
                {
                    "name": "HDD 500 Gb",
                    "link": "https://www.avito.ru/all/tovary_dlya_kompyutera/komplektuyuschie/zhestkie_diski-ASgBAgICAkTGB~pm7gmwZw?cd=1&q=hdd+500gb",
                    "price": 1000,
                    "comment": "Используем для игр!  При покупке обязательно проверяем в Crystal Disk! Что бы состояние было приближенное к идеалу"
                },
                {
                    "name": "ARGB Контроллер",
                    "link": "https://www.ozon.ru/product/kompyuternaya-sborka-kontroller-dlya-ventilyatorov-chernoe-5v-3pin-argb-i-ventilyatorov-4pin-po-sata-1781303264/?at=ywtAoyrJ1FDAXwwMsYG2KXQc8gAYMNhKloMwmCNwm6rK",
                    "price": 1000,
                    "comment": "Понадобится для настройки подсветки кулеров корпуса и кулера для процессора. Так как наша материнка им не обладает!"
                }
            ],
            "pccomment": "Наверное единственный адекватный минимум который можно себе представить, за свою цены мы получаем хороший фпс в онлайн играх и базовый настройки для AAA"
        },
        {
            "id": 2,
            "pcname": "ПК ЗА 30к",
            "pcprice": 27300,
            "components": [
                {
                    "name": "Видеокарта - GTX 1060 6 Gb",
                    "link": "https://www.avito.ru/all/tovary_dlya_kompyutera/komplektuyuschie/videokarty-ASgBAgICAkTGB~pm7gmmZw?cd=1&q=1060+6gb",
                    "price": 6000,
                    "comment": "Старенькая но тем неменее самый минимальный вариант который мы можем взять для игр в 2026, Будь то онлайн игры или AAA. Хотя ААА пойдут сильно тяжелее чем те же онлайн игры"
                },
                {
                    "name": "Процессор - Ryzen 5 2600",
                    "link": "https://www.avito.ru/all/tovary_dlya_kompyutera/komplektuyuschie/protsessory-ASgBAgICAkTGB~pm7gniZw?cd=1&q=ryzen+5+2600",
                    "price": 2500,
                    "comment": "Старый прцоессор, но тем не менее на борту 6 ядер 12 потоков, с неплохой частотой, даст поиграть в онлайн игры еще пару лет точно, для старта неплохой проц"
                },
                {
                    "name": "Материнская плата a320 или b450 (любая)",
                    "link": "https://www.avito.ru/all/tovary_dlya_kompyutera/komplektuyuschie/materinskie_platy-ASgBAgICAkTGB~pm7gnOZw?cd=1&f=ASgBAgECAkTGB~pm7gnOZwFFxpoMFHsiZnJvbSI6MCwidG8iOjQwMDB9&q=am4",
                    "price": 3000,
                    "comment": "Ищем старенькую b450 или a320 разницы почти нет, главное минимальный ценик и что бы работала, наш процессор самый чиловый парень которого вы знаете"
                },
                {
                    "name": "SSD NVME - 256Gb",
                    "link": "https://www.avito.ru/all/tovary_dlya_kompyutera/komplektuyuschie/zhestkie_diski-ASgBAgICAkTGB~pm7gmwZw?cd=1&q=ssd+m2+256",
                    "price": 2500,
                    "comment": "Берем для системы и программ, для игр рекомендую взять HDD на 500 гигабайт. При покупке обязательно проверяем в Crystal Disk! Что бы состояние было приближенное к идеалу"
                },
                {
                    "name": "Оперативная память",
                    "link": "https://www.avito.ru/all/tovary_dlya_kompyutera/komplektuyuschie-ASgBAgICAUTGB~pm?cd=1&q=оперативная+память+ddr4+16gb",
                    "price": 6000,
                    "comment": "Ищем 16 гигабайт в условиях ограниченного бюджета главное взять одинаковые плашки, а так берите с частотой  2133 или если найдете лучше то можете взять больше но до 6.000 в основном это будут 2133 и плохие тайминги, но это не критично"
                },
                {
                    "name": "Блок питания Powercase PW500, 500W, 80+ Standart (PS-500W-DC)",
                    "link": "https://www.onlinetrade.ru/catalogue/bloki_pitaniya_dlya_kompyutera-c339/powercase/blok_pitaniya_powercase_pw500_500w_80_standart_ps_500w_dc-4416114.html",
                    "price": 3000,
                    "comment": "Японский конденсатор на входе, китай на выходе. Есть защиты от перегрева и от замыкания. Гарантия 36 мес."
                },
                {
                    "name": "Корпус",
                    "link": "https://www.avito.ru/all/tovary_dlya_kompyutera/komplektuyuschie/korpusа-ASgBAgICAkTGB~pm7gnEZw?cd=1&f=ASgBAgECAkTGB~pm7gnEZwFFxpoMFHsiZnJvbSI6MCwidG8iOjIwMDB9&q=корпус+для+пк+компьютера",
                    "price": 2000,
                    "comment": "Любой корпус до 2.000 рублей который понравится! Нет у нас денег добавлять на корпус лучше"
                },
                {
                    "name": "Кулер для процессора JONSBO CR-1000E Black",
                    "link": "https://www.onlinetrade.ru/catalogue/kulery_dlya_protsessorov-c1492/jonsbo/kuler_dlya_protsessora_jonsbo_cr_1000e_black-4425957.html",
                    "price": 1300,
                    "comment": "Базовый кулер для нашего процессора хватит с головой. Также достаточно приятный внешний вид"
                },
                {
                    "name": "HDD 500 Gb",
                    "link": "https://www.avito.ru/all/tovary_dlya_kompyutera/komplektuyuschie/zhestkie_diski-ASgBAgICAkTGB~pm7gmwZw?cd=1&q=hdd+500gb",
                    "price": 1000,
                    "comment": "Используем для игр!  При покупке обязательно проверяем в Crystal Disk! Что бы состояние было приближенное к идеалу"
                }
            ],
            "pccomment": "Такой пк рекомендую брать только в одном случае, ну если денег прям совсем нет, а поиграть в какую нибудь кску или пабг хочется, тогда да дерзайте, но на AAA не расчитывайте"
        },
        {
            "id": 3,
            "pcname": "ПК ЗА 35к",
            "pcprice": 34300,
            "components": [
                {
                    "name": "Видеокарта - GTX 1660 Super",
                    "link": "https://www.avito.ru/all/tovary_dlya_kompyutera/komplektuyuschie/videokarty-ASgBAgICAkTGB~pm7gmmZw?cd=1&q=1660+super",
                    "price": 10000,
                    "comment": "Наш реальный базовый минимум для Full HD. Будет неплохо показывать себя в онлайн проектах еще долго, но в AAA играх ей будет крайне тяжело, за счет маленького обема видеопамяти. Пару лет на низких поиграть сможете."
                },
                {
                    "name": "Процессор - Ryzen 5 3600",
                    "link": "https://www.avito.ru/all/tovary_dlya_kompyutera/komplektuyuschie/protsessory-ASgBAgICAkTGB~pm7gniZw?cd=1&q=ryzen+5+2600",
                    "price": 4500,
                    "comment": "Старый прцоессор, но тем не менее на борту 6 ядер 12 потоков, с неплохой частотой, даст поиграть в онлайн игры еще пару лет точно, для старта неплохой проц"
                },
                {
                    "name": "Материнская плата a320 или b450 (любая)",
                    "link": "https://www.avito.ru/all/tovary_dlya_kompyutera/komplektuyuschie/materinskie_platy-ASgBAgICAkTGB~pm7gnOZw?cd=1&f=ASgBAgECAkTGB~pm7gnOZwFFxpoMFHsiZnJvbSI6MCwidG8iOjQwMDB9&q=am4",
                    "price": 3000,
                    "comment": "Ищем старенькую b450 или a320 разницы почти нет, главное минимальный ценик и что бы работала, наш процессор самый чиловый парень которого вы знаете"
                },
                {
                    "name": "SSD NVME - 256Gb",
                    "link": "https://www.avito.ru/all/tovary_dlya_kompyutera/komplektuyuschie/zhestkie_diski-ASgBAgICAkTGB~pm7gmwZw?cd=1&q=ssd+m2+256",
                    "price": 2500,
                    "comment": "Берем для системы и программ, для игр рекомендую взять HDD на 500 гигабайт. При покупке обязательно проверяем в Crystal Disk! Что бы состояние было приближенное к идеалу"
                },
                {
                    "name": "Оперативная память",
                    "link": "https://www.avito.ru/all/tovary_dlya_kompyutera/komplektuyuschie-ASgBAgICAUTGB~pm?cd=1&q=оперативная+память+ddr4+16gb",
                    "price": 7000,
                    "comment": "Ищем 16 гигабайт с частотой 3200, и первым таймингом cl16 или cl18. Проверяйте оперативку что бы работала в XMP профиле, и самое главно что бы плашки были одинаковые! Для работы двух канала"
                },
                {
                    "name": "Блок питания Powercase PW500, 500W, 80+ Standart (PS-500W-DC)",
                    "link": "https://www.onlinetrade.ru/catalogue/bloki_pitaniya_dlya_kompyutera-c339/powercase/blok_pitaniya_powercase_pw500_500w_80_standart_ps_500w_dc-4416114.html",
                    "price": 3000,
                    "comment": "Японский конденсатор на входе, китай на выходе. Есть защиты от перегрева и от замыкания. Гарантия 36 мес."
                },
                {
                    "name": "Корпус",
                    "link": "https://www.avito.ru/all/tovary_dlya_kompyutera/komplektuyuschie/korpusа-ASgBAgICAkTGB~pm7gnEZw?cd=1&f=ASgBAgECAkTGB~pm7gnEZwFFxpoMFHsiZnJvbSI6MCwidG8iOjIwMDB9&q=корпус+для+пк+компьютера",
                    "price": 2000,
                    "comment": "Любой корпус до 2.000 рублей который понравится! Нет у нас денег добавлять на корпус лучше"
                },
                {
                    "name": "Кулер для процессора JONSBO CR-1000E Black",
                    "link": "https://www.onlinetrade.ru/catalogue/kulery_dlya_protsessorov-c1492/jonsbo/kuler_dlya_protsessora_jonsbo_cr_1000e_black-4425957.html",
                    "price": 1300,
                    "comment": "Базовый кулер для нашего процессора хватит с головой. Также достаточно приятный внешний вид"
                },
                {
                    "name": "HDD 500 Gb",
                    "link": "https://www.avito.ru/all/tovary_dlya_kompyutera/komplektuyuschie/zhestkie_diski-ASgBAgICAkTGB~pm7gmwZw?cd=1&q=hdd+500gb",
                    "price": 1000,
                    "comment": "Используем для игр!  При покупке обязательно проверяем в Crystal Disk! Что бы состояние было приближенное к идеалу"
                }
            ],
            "pccomment": "Идеальный вариант для онлайн игр. Не дорого и сердито. 6 ядерный райзен себя хорошо в них покажет, но вот AAA будут идти тяжело"
        },
        {
            "id": 4,
            "pcname": "ПК ЗА 50к",
            "pcprice": 49500,
            "components": [
                {
                    "name": "Видеокарта - RX 6600",
                    "link": "https://www.avito.ru/all/tovary_dlya_kompyutera/komplektuyuschie/videokarty-ASgBAgICAkTGB~pm7gmmZw?cd=1&q=rx6600",
                    "price": 14000,
                    "comment": "Одна из лучших видеокарт за свою стоимость, Full Hd идет хорошо. На рынке очень много живых не бывавших в майнинге видеокарт. Является полным аналогом RTX 2060 SUPER, елси прям боитесь брать amd то можно взять ее. Но цена будет чуть выше, а состояние в основном хуже"
                },
                {
                    "name": "Процессор - Ryzen 5 5600 (X)",
                    "link": "https://www.avito.ru/all/tovary_dlya_kompyutera/komplektuyuschie/protsessory-ASgBAgICAkTGB~pm7gniZw?cd=1&q=5600",
                    "price": 9000,
                    "comment": "Так же прекрасный компонент для этого пк. Один из лучших процессоров по соотоншению цены качества, для онлайн игр топ, для AAA  пока что средне-высокие потянит, смело берите и не переживайте!"
                },
                {
                    "name": "Материнская плата MSI A520M-A PRO (AM4, mATX)",
                    "link": "https://www.onlinetrade.ru/catalogue/materinskie_platy-c340/msi/materinskaya_plata_msi_a520m_a_pro_am4_matx-2493803.html",
                    "price": 5500,
                    "comment": "Новая материнка без мороки, взяли поставили и пользуетесь. Ryzen 5 5600 зону vrm все будет хорошо. Брать б\\у почему не советую потому что найти б чипсет за норм цену тяжело"
                },
                {
                    "name": "SSD NVME - 512GB",
                    "link": "https://www.avito.ru/all/tovary_dlya_kompyutera/komplektuyuschie/zhestkie_diski-ASgBAgICAkTGB~pm7gmwZw?cd=1&q=ssd+m2+nvme+512gb",
                    "price": 5000,
                    "comment": "Берем для системы и программ, ищем перекупа который продает новый ssd с китая, обычно это всякие cusu и kingspec. Если памяти прям не будет хватать докупите за 1к еще 512 HDD"
                },
                {
                    "name": "Оперативная память",
                    "link": "https://www.avito.ru/all/tovary_dlya_kompyutera/komplektuyuschie-ASgBAgICAUTGB~pm?cd=1&q=оперативная+память+ddr4+16gb",
                    "price": 7000,
                    "comment": "Ищем 16 гигабайт с частотой 3200, и первым таймингом cl16 или cl18. Проверяйте оперативку что бы работала в XMP профиле, и самое главно что бы плашки были одинаковые! Для работы двух канала"
                },
                {
                    "name": "Блок питания Deepcool GAMERSTORM PF600X, 600W, 80+ Bronze, ATX 2.52",
                    "link": "https://www.onlinetrade.ru/item4840557.html",
                    "price": 3000,
                    "comment": "Японские конденсаторы в круг. Защита от замыкания и перегрева. 80+ бронз сертификат. Не путать с обычной PF линейкой без X."
                },
                {
                    "name": "Корпус XASTRA A305M 3ARGB, черный",
                    "link": "https://www.onlinetrade.ru/catalogue/kompyuternye_korpusa-c1323/xastra/korpus_xastra_a305m_3argb_chernyy_a305m_2fc14a_1fc12a_d-4714577.html?utm_referrer=https%3a%2f%2fwww.google.com%2f",
                    "price": 3500,
                    "comment": "Красивый, стильный корпус. С 3 ARGB вентиляторами в комплектке. Так же открывается боковая крышка. За свою цену топ!"
                },
                {
                    "name": "Кулер для процессора JONSBO CR-1000 EVO ARGB (Black)",
                    "link": "https://www.onlinetrade.ru/catalogue/kulery_dlya_protsessorov-c1492/jonsbo/kuler_dlya_protsessora_jonsbo_cr_1000_evo_argb_black-3784863.html",
                    "price": 1500,
                    "comment": "Базовый кулер с T.D.P 180w для нашего процессора хватит с головой. Также достаточно приятный внешний вид"
                },
                {
                    "name": "ARGB Контроллер",
                    "link": "https://www.ozon.ru/product/kompyuternaya-sborka-kontroller-dlya-ventilyatorov-chernoe-5v-3pin-argb-i-ventilyatorov-4pin-po-sata-1781303264/?at=ywtAoyrJ1FDAXwwMsYG2KXQc8gAYMNhKloMwmCNwm6rK",
                    "price": 1000,
                    "comment": "Понадобится для настройки подсветки кулеров корпуса и кулера для процессора. Так как наша материнка им не обладает!"
                }
            ],
            "pccomment": "Хороший Full Hd гейминг, с закрытием базовых потребностей в виде онлайн игр. Но AAA идут тяжело. Пока что это низкие настройки а дальше будет только хуже("
        },
        {
            "id": 5,
            "pcname": "ПК ЗА 55к",
            "pcprice": 55500,
            "components": [
                {
                    "name": "Видеокарта - RTX 3060",
                    "link": "https://www.avito.ru/all/tovary_dlya_kompyutera/komplektuyuschie/videokarty-ASgBAgICAkTGB~pm7gmmZw?cd=1&q=3060",
                    "price": 20000,
                    "comment": "Одна из лучших видеокарт за свою стоимость, при этом она идет еще и на 12 гигов видео памяти, так- что в Full HD еще пару лет на ней поиграть сможете! Хорошая уверенная карточка!"
                },
                {
                    "name": "Процессор - Ryzen 5 5600 (X)",
                    "link": "https://www.avito.ru/all/tovary_dlya_kompyutera/komplektuyuschie/protsessory-ASgBAgICAkTGB~pm7gniZw?cd=1&q=5600",
                    "price": 9000,
                    "comment": "Так же прекрасный компонент для этого пк. Один из лучших процессоров по соотоншению цены качества, для онлайн игр топ, для AAA  пока что средне-высокие потянит, смело берите и не переживайте!"
                },
                {
                    "name": "Материнская плата MSI A520M-A PRO (AM4, mATX)",
                    "link": "https://www.onlinetrade.ru/catalogue/materinskie_platy-c340/msi/materinskaya_plata_msi_a520m_a_pro_am4_matx-2493803.html",
                    "price": 5500,
                    "comment": "Новая материнка без мороки, взяли поставили и пользуетесь. Ryzen 5 5600 зону vrm все будет хорошо. Брать б\\у почему не советую потому что найти б чипсет за норм цену тяжело"
                },
                {
                    "name": "SSD NVME - 512GB",
                    "link": "https://www.avito.ru/all/tovary_dlya_kompyutera/komplektuyuschie/zhestkie_diski-ASgBAgICAkTGB~pm7gmwZw?cd=1&q=ssd+m2+nvme+512gb",
                    "price": 5000,
                    "comment": "Берем для системы и программ, ищем перекупа который продает новый ssd с китая, обычно это всякие cusu и kingspec. Если памяти прям не будет хватать докупите за 1к еще 512 HDD"
                },
                {
                    "name": "Оперативная память",
                    "link": "https://www.avito.ru/all/tovary_dlya_kompyutera/komplektuyuschie-ASgBAgICAUTGB~pm?cd=1&q=оперативная+память+ddr4+16gb",
                    "price": 7000,
                    "comment": "Ищем 16 гигайт с частотой 3200, и первым таймингом cl16 или cl18. Проверяйте оперативку что бы работала в XMP профиле, и самое главно что бы плашки были одинаковые! Для работы двух канала"
                },
                {
                    "name": "Блок питания Deepcool GAMERSTORM PF600X, 600W, 80+ Bronze, ATX 2.52",
                    "link": "https://www.onlinetrade.ru/item4840557.html",
                    "price": 3000,
                    "comment": "Японские конденсаторы в круг. Защита от замыкания и перегрева. 80+ бронз сертификат. Не путать с обычной PF линейкой без X."
                },
                {
                    "name": "Корпус XASTRA A305M 3ARGB, черный",
                    "link": "https://www.onlinetrade.ru/catalogue/kompyuternye_korpusa-c1323/xastra/korpus_xastra_a305m_3argb_chernyy_a305m_2fc14a_1fc12a_d-4714577.html?utm_referrer=https%3a%2f%2fwww.google.com%2f",
                    "price": 3500,
                    "comment": "Красивый, стильный корпус. С 3 ARGB вентиляторами в комплектке. Так же открывается боковая крышка. За свою цену топ!"
                },
                {
                    "name": "Кулер для процессора JONSBO CR-1000 EVO ARGB (Black)",
                    "link": "https://www.onlinetrade.ru/catalogue/kulery_dlya_protsessorov-c1492/jonsbo/kuler_dlya_protsessora_jonsbo_cr_1000_evo_argb_black-3784863.html",
                    "price": 1500,
                    "comment": "Базовый кулер с T.D.P 180w для нашего процессора хватит с головой. Также достаточно приятный внешний вид"
                },
                {
                    "name": "ARGB Контроллер",
                    "link": "https://www.ozon.ru/product/kompyuternaya-sborka-kontroller-dlya-ventilyatorov-chernoe-5v-3pin-argb-i-ventilyatorov-4pin-po-sata-1781303264/?at=ywtAoyrJ1FDAXwwMsYG2KXQc8gAYMNhKloMwmCNwm6rK",
                    "price": 1000,
                    "comment": "Понадобится для настройки подсветки кулеров корпуса и кулера для процессора. Так как наша материнка им не обладает!"
                }
            ],
            "pccomment": "Уверенный Full Hd гейминг, очень сбалансированая и выгодная сборка. По сути закрывает все базовые потребности вплане игр."
        },
        {
            "id": 6,
            "pcname": "ПК ЗА 60к",
            "pcprice": 60000,
            "components": [
                {
                    "name": "Видеокарта - RTX 3070",
                    "link": "https://www.avito.ru/all/tovary_dlya_kompyutera/komplektuyuschie/videokarty-ASgBAgICAkTGB~pm7gmmZw?cd=1&q=3060",
                    "price": 24500,
                    "comment": "Лучшая бу видеокарта по соотношению цены-качества. Дает очень много фпс, по мощьности аналог 5060. Главная проблема найти живую, очень много бывали в майнинге"
                },
                {
                    "name": "Процессор - Ryzen 5 5600 (X)",
                    "link": "https://www.avito.ru/all/tovary_dlya_kompyutera/komplektuyuschie/protsessory-ASgBAgICAkTGB~pm7gniZw?cd=1&q=5600",
                    "price": 9000,
                    "comment": "Так же прекрасный компонент для этого пк. Один из лучших процессоров по соотоншению цены качества, для онлайн игр топ, для AAA  пока что средне-высокие потянит, смело берите и не переживайте!"
                },
                {
                    "name": "Материнская плата MSI A520M-A PRO (AM4, mATX)",
                    "link": "https://www.onlinetrade.ru/catalogue/materinskie_platy-c340/msi/materinskaya_plata_msi_a520m_a_pro_am4_matx-2493803.html",
                    "price": 5500,
                    "comment": "Новая материнка без мороки, взяли поставили и пользуетесь. Ryzen 5 5600 зону vrm все будет хорошо. Брать б\\у почему не советую потому что найти б чипсет за норм цену тяжело"
                },
                {
                    "name": "SSD NVME - 512GB",
                    "link": "https://www.avito.ru/all/tovary_dlya_kompyutera/komplektuyuschie/zhestkie_diski-ASgBAgICAkTGB~pm7gmwZw?cd=1&q=ssd+m2+nvme+512gb",
                    "price": 5000,
                    "comment": "Берем для системы и программ, ищем перекупа который продает новый ssd с китая, обычно это всякие cusu и kingspec. Если памяти прям не будет хватать докупите за 1к еще 512 HDD"
                },
                {
                    "name": "Оперативная память",
                    "link": "https://www.avito.ru/all/tovary_dlya_kompyutera/komplektuyuschie-ASgBAgICAUTGB~pm?cd=1&q=оперативная+память+ddr4+16gb",
                    "price": 7000,
                    "comment": "Ищем 16 гигабайт с частотой 3200, и первым таймингом cl16 или cl18. Проверяйте оперативку что бы работала в XMP профиле, и самое главно что бы плашки были одинаковые! Для работы двух канала"
                },
                {
                    "name": "Блок питания Deepcool GAMERSTORM PF600X, 600W, 80+ Bronze, ATX 2.52",
                    "link": "https://www.onlinetrade.ru/item4840557.html",
                    "price": 3000,
                    "comment": "Японские конденсаторы в круг. Защита от замыкания и перегрева. 80+ бронз сертификат. Не путать с обычной PF линейкой без X."
                },
                {
                    "name": "Корпус XASTRA A305M 3ARGB, черный",
                    "link": "https://www.onlinetrade.ru/catalogue/kompyuternye_korpusa-c1323/xastra/korpus_xastra_a305m_3argb_chernyy_a305m_2fc14a_1fc12a_d-4714577.html?utm_referrer=https%3a%2f%2fwww.google.com%2f",
                    "price": 3500,
                    "comment": "Красивый, стильный корпус. С 3 ARGB вентиляторами в комплектке. Так же открывается боковая крышка. За свою цену топ!"
                },
                {
                    "name": "Кулер для процессора JONSBO CR-1000 EVO ARGB (Black)",
                    "link": "https://www.onlinetrade.ru/catalogue/kulery_dlya_protsessorov-c1492/jonsbo/kuler_dlya_protsessora_jonsbo_cr_1000_evo_argb_black-3784863.html",
                    "price": 1500,
                    "comment": "Базовый кулер с T.D.P 180w для нашего процессора хватит с головой. Также достаточно приятный внешний вид"
                },
                {
                    "name": "ARGB Контроллер",
                    "link": "https://www.ozon.ru/product/kompyuternaya-sborka-kontroller-dlya-ventilyatorov-chernoe-5v-3pin-argb-i-ventilyatorov-4pin-po-sata-1781303264/?at=ywtAoyrJ1FDAXwwMsYG2KXQc8gAYMNhKloMwmCNwm6rK",
                    "price": 1000,
                    "comment": "Понадобится для настройки подсветки кулеров корпуса и кулера для процессора. Так как наша материнка им не обладает!"
                }
            ],
            "pccomment": "Уверенный пк, на пару лет вперед! Года два назад была самая мощьная сборка на районе. Сейчас все также, берите хватит на много лет вперед!"
        }
    ]

};

if (typeof module !== 'undefined' && module.exports) {
    module.exports = botDb;
}
